
&НаСервере
Процедура ВКМ_ВидДоговораПриИзмененииНаСервере()
	
	// Реквизиты договора Абонентское обслуживание
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ГруппаФормы = ЭтаФорма.Элементы.Добавить("ВКМ_ГруппаПериодДействияДоговора", Тип("ГруппаФормы"),ЭтаФорма);
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормы.Заголовок = "Период действия договора";
		ГруппаФормы.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		ГруппаФормы.ОтображатьЗаголовок = ИСТИНА; 
		ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаФормы.РастягиватьПоГоризонтали = ИСТИНА;
		
		ЭлементФормы = Элементы.Добавить("ВКМ_НачалоДействияДоговора",Тип("ПолеФормы"),Элементы.ВКМ_ГруппаПериодДействияДоговора);	
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора"; 
		ЭлементФормы.Заголовок = "с";
		
		ЭлементФормы = Элементы.Добавить("ВКМ_КонецДействияДоговора",Тип("ПолеФормы"),Элементы.ВКМ_ГруппаПериодДействияДоговора);	
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";   
		ЭлементФормы.Заголовок = "по";
		
		ЭлементФормы = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты",Тип("ПолеФормы"));	
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";  
		
		ЭлементФормы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы",Тип("ПолеФормы"));	
		ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";  		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры
